In [2]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as ply

멀티 인덱스

In [4]:
my_header = ['a', 'b', 'c']

In [5]:
my_index_out = ['G1']*3 + ['G2']*3
my_index_out

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [6]:
my_index_in = [1,2,3]*2
my_index_in

[1, 2, 3, 1, 2, 3]

In [7]:
list(zip(my_index_out, my_index_in))  #zip의 기능: 양쪽 리스트에서 하나씩 가져온다

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [8]:
my_index_zipped = list(zip(my_index_out, my_index_in))
my_index_zipped

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [9]:
my_index = pd.MultiIndex.from_tuples(my_index_zipped)
#my_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [16]:
#멀티인덱스
df = pd.DataFrame(np.random.randn(6,3), columns = my_header, index=my_index)
df

             a         b         c
G1 1  1.131884  1.028581 -1.809105
   2  0.546738 -0.970498 -0.289826
   3 -1.129467  0.339713  1.192717
G2 1  0.441619 -0.780814  0.127958
   2 -0.210957  0.574267 -0.567096
   3 -0.925435 -1.594332  1.336871

In [19]:
df.loc['G1']

          a         b         c
1  1.131884  1.028581 -1.809105
2  0.546738 -0.970498 -0.289826
3 -1.129467  0.339713  1.192717

In [22]:
df.loc['G1'].loc[1:2]

          a         b         c
1  1.131884  1.028581 -1.809105
2  0.546738 -0.970498 -0.289826

In [27]:
# 멀티인덱싱에서 슬라이싱하는 방법 
df.loc['G1'].loc[1,'c']

-1.8091050163898308

In [31]:
os.chdir(r'C:\Users\injoo\광주 인공지능 사관학교\실습 파일\라이브러리 실습\________\data')
df = pd.read_csv("data_studentlist_en.csv")
df

                name gender  age  grade absence bloodtype  height  weight
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2       Brian Martin      M   24      4       N         B   175.0    80.1
3       David Hassel      M   23      3       N        AB   182.1    85.7
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
8       John Bertsch      M   23      3       N         B   178.5    64.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
11      John Matsuda      M   22      2       N        AB   180.0    75.8
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16      Andrew Daley      M   21      1       N         A   169.2    62.2

In [32]:
df[df.gender=='M'].height.mean()

172.41

In [33]:
df[df.gender=='F'].height.mean()

166.64285714285714

In [36]:
#SELECT AVG(height) FROM df GROUP BY gender
#이런 유형의 문제 시험 나온다. 치환하기
df.groupby("gender")[["height", "weight"]].mean()

            height     weight
gender
F       166.642857  50.442857
M       172.410000  68.500000

In [38]:
#그룹을 만드는 조건: 명목형 변수를 넣어준다
dfr = df.groupby(['gender', 'bloodtype'])[['height', 'weight']].mean()
dfr

                      height     weight
gender bloodtype
F      A          172.450000  52.250000
       AB         170.100000  53.000000
       B          158.200000  45.200000
       O          164.433333  50.133333
M      A          165.700000  58.750000
       AB         181.050000  80.750000
       B          174.550000  68.950000
       O          166.200000  65.100000

In [39]:
dfr.loc['M'].loc['A'].height

165.7

In [41]:
sr = df.groupby(['gender', 'bloodtype'])['height'].mean()
sr

gender  bloodtype
F       A            172.450000
        AB           170.100000
        B            158.200000
        O            164.433333
M       A            165.700000
        AB           181.050000
        B            174.550000
        O            166.200000
Name: height, dtype: float64

In [42]:
sr['M']['AB']

181.05

In [45]:
df.height = df.height.apply(lambda x: x/100)

In [46]:
df.height

0     1.653
1     1.701
2     1.750
3     1.821
4     1.680
5     1.620
6     1.552
7     1.769
8     1.785
9     1.761
10    1.671
11    1.800
12    1.622
13    1.761
14    1.582
15    1.686
16    1.692
Name: height, dtype: float64

In [52]:
#정렬하기. 명목형 변수, 수치형 변수 둘 다 가능하다
#두 개 이상의 기준으로 정렬할 때, 정렬 스타일을 달리 할 수 있다
df.sort_values(by=['bloodtype', 'age'], ascending=[True, False]).reset_index(drop=True)

                name gender  age  grade absence bloodtype  height  weight
0    Margareth Jones      F   23      1       N         A   1.769    55.0
1       Eddy Johnson      M   21      1       N         A   1.622    55.3
2       Andrew Daley      M   21      1       N         A   1.692    62.2
3    Clara Rodriquez      F   20      1       Y         A   1.680    49.5
4       David Hassel      M   23      3       N        AB   1.821    85.7
5     Sarah O'Donnel      F   22      2       N        AB   1.701    53.0
6       John Matsuda      M   22      2       N        AB   1.800    75.8
7       Brian Martin      M   24      4       N         B   1.750    80.1
8     Richard Swayze      M   24      4       Y         B   1.686    70.2
9       John Bertsch      M   23      3       N         B   1.785    64.2
10    Jake Timmerman      M   22      2       N         B   1.761    61.3
11      Linda Carter      F   22      2       N         B   1.582    45.2
12     Joshua Connor      M   24      4       Y         O   1.671    62.0
13     Jared Diamond      M   23      3       Y         O   1.653    68.2
14  Rebecah Anderson      F   23      3       N         O   1.761    53.1
15       Susan Clark      F   22      1       N         O   1.552    45.3
16  Jennifer Lorentz      F   21      2       N         O   1.620    52.0

In [53]:
df.height.sort_values().reset_index(drop=True)

0     1.552
1     1.582
2     1.620
3     1.622
4     1.653
5     1.671
6     1.680
7     1.686
8     1.692
9     1.701
10    1.750
11    1.761
12    1.761
13    1.769
14    1.785
15    1.800
16    1.821
Name: height, dtype: float64

In [54]:
df.bloodtype.value_counts()

B     5
O     5
A     4
AB    3
Name: bloodtype, dtype: int64

In [55]:
df.bloodtype.mode()

0    B
1    O
dtype: object

In [61]:
df.groupby("gender")[['height']].mean()    #['height'] 하면 시리즈인데 [['height']] 하면 dataframe으로 나온다

          height
gender
F       1.666429
M       1.724100

In [67]:
#pivot_table은 groupby 의 확장형이다
#columns에 absence를 추가하니 na가 나온다
pd.pivot_table(df, index=['gender'], columns=['absence', 'bloodtype'],values=['height'], aggfunc=np.mean, fill_value=0)

          height
absence        N                                 Y
bloodtype      A      AB         B         O     A      B      O
gender
F          1.769  1.7010  1.582000  1.644333  1.68  0.000  0.000
M          1.657  1.8105  1.765333  0.000000  0.00  1.686  1.662

In [68]:
#height와 weight에 각각 다른 방식으로 집계도 가능하다. 
pd.pivot_table(df, index=['gender'], values=['height', 'weight'], aggfunc={"height":np.mean, "weight": np.median})

          height  weight
gender
F       1.666429    52.0
M       1.724100    66.2

In [70]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                          "bar", "bar", "bar", "bar"],
                    "B": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "C": ["small", "large", "large", "small",
                          "small", "large", "small", "small",
                          "large"],
                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [74]:
df.groupby(['A', 'B'])[['D', 'E']].mean()

                D         E
A   B
bar one  4.500000  7.000000
    two  6.500000  9.000000
foo one  1.666667  3.666667
    two  3.000000  5.500000

In [75]:
#D와 E의 그룹평균
#위에 것과 같다?
pd.pivot_table(df, index=['A', 'B'], values=['D', 'E'], aggfunc={'D':np.mean, "E":np.median})

                D    E
A   B
bar one  4.500000  7.0
    two  6.500000  9.0
foo one  1.666667  4.0
    two  3.000000  5.5